dev/playgrounds/ground1/benchmark.yml
config:
  target: 'http://localhost:2002' # Replace with your API endpoint
  phases:
    - duration: 60 # Test duration in seconds
      arrivalRate: 5000 # Number of requests per second (concurrent users)

scenarios:
  - flow:
      - get:
          url: '/api/v1/hello' # Replace with your API's endpoint